### DEMOGRAPHIC PARITY 

Compute the difference between the proportion of <b>identified-as-male with an income greater than '50k'</b> and the <b>proportion of identified-as-female with an income greater than $50k</b>. Does the data seem fair by this measure?

This measure is not exactly demographic parity, since we are not making a prediction: We are just computing the “fairness” of the input data itself. So, we are substituting the true income for the predicted income.

In [1]:
import numpy as np
import pandas as pd


data = pd.read_csv('/Users/jennyskytta/Desktop/Jupyter/MLProjects/adult.csv',encoding='latin1', header=None, names=["age", "workclass", "fnlwgt", "education", "edu_num", "maritalstat", "occupation", "relationship", "race", "sex", "cap_gain", "cap_loss", "hrs_per_wk", "native_country", "morethan50k"])
data.sample(5)

/var/folders/rc/ylf7hxm13x365r22_1xp_ybc0000gn/T/ipykernel_7115/2535673543.py:5: DtypeWarning: Columns (0,1,3,5,11,12,13) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('/Users/jennyskytta/Desktop/Jupyter/MLProjects/adult.csv',encoding='latin1', header=None, names=["age", "workclass", "fnlwgt", "education", "edu_num", "maritalstat", "occupation", "relationship", "race", "sex", "cap_gain", "cap_loss", "hrs_per_wk", "native_country", "morethan50k"])

,age,workclass,fnlwgt,education,edu_num,maritalstat,occupation,relationship,race,sex,cap_gain,cap_loss,hrs_per_wk,native_country,morethan50k
11698,19,Private,39623,Some-college,10,Never-married,Sales,Own-child,White,Female,0,0,25,United-States,<=50K
14574,22,?,140414,Some-college,10,Never-married,?,Own-child,White,Male,0,0,40,United-States,<=50K
9752,27,Private,285897,HS-grad,9,Married-civ-spouse,Transport-moving,Husband,White,Male,0,1887,40,United-States,>50K
31551,62,Private,122033,HS-grad,9,Widowed,Adm-clerical,Not-in-family,White,Female,0,0,38,United-States,<=50K
43400,60,Private,93997,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,15024,0,45,United-States,>50K

In [2]:
small = data.drop(['cap_gain','cap_loss','hrs_per_wk','native_country', 'fnlwgt', 'age','workclass', 'education','edu_num','maritalstat','occupation','relationship','race'], axis=1)
small.sample(2)

        sex morethan50k
17021  Male        >50K
7967   Male       <=50K

In [8]:
sex = data['sex']
sex.value_counts()

Male      32650
Female    16192
gender        1
Name: sex, dtype: int64

In [9]:
group = small.groupby(['sex', 'morethan50k']).value_counts()
group

sex     morethan50k
Female  <=50K          14423
        >50K            1769
Male    <=50K          22732
        >50K            9918
gender  income             1
dtype: int64

In [10]:
women =1179/10771
men = 6662/21790
print(women)
print(men)

0.10946058861758426
0.3057365764111978

In [12]:
small.dtypes

sex            object
morethan50k    object
dtype: object

In [13]:
small = data.drop(['cap_gain','cap_loss','hrs_per_wk','native_country', 'fnlwgt', 'age','workclass','edu_num','maritalstat','occupation','relationship','race'], axis=1)
small.sample(2)

      education     sex morethan50k
6666       11th    Male       <=50K
30164   HS-grad  Female       <=50K

In [14]:
small['education']

x           education
1                11th
2             HS-grad
3          Assoc-acdm
4        Some-college
             ...
48838      Assoc-acdm
48839         HS-grad
48840         HS-grad
48841         HS-grad
48842         HS-grad
Name: education, Length: 48843, dtype: object

In [15]:
edu_mask = small['education'] == 'Doctorate'
edu_mask

x        False
1        False
2        False
3        False
4        False
         ...
48838    False
48839    False
48840    False
48841    False
48842    False
Name: education, Length: 48843, dtype: bool

In [16]:
edu_doc = small[edu_mask]
edu_doc

       education     sex morethan50k
20     Doctorate    Male        >50K
127    Doctorate  Female        >50K
134    Doctorate    Male        >50K
167    Doctorate    Male        >50K
330    Doctorate    Male        >50K
...          ...     ...         ...
48711  Doctorate  Female        >50K
48751  Doctorate  Female       <=50K
48752  Doctorate  Female       <=50K
48814  Doctorate    Male        >50K
48821  Doctorate    Male        >50K

[594 rows x 3 columns]

In [18]:
test = small[small['education'] =='Doctorate']
test

       education     sex morethan50k
20     Doctorate    Male        >50K
127    Doctorate  Female        >50K
134    Doctorate    Male        >50K
167    Doctorate    Male        >50K
330    Doctorate    Male        >50K
...          ...     ...         ...
48711  Doctorate  Female        >50K
48751  Doctorate  Female       <=50K
48752  Doctorate  Female       <=50K
48814  Doctorate    Male        >50K
48821  Doctorate    Male        >50K

[594 rows x 3 columns]

In [19]:
small[small['education']=="Some-college"].count()

education      10878
sex            10878
morethan50k    10878
dtype: int64

In [42]:
display(data.loc[(data['sex'].str.startswith('F') & (data['morethan50k'].str.startswith('>')))])

Empty DataFrame
Columns: [age, workclass, fnlwgt, education, edu_num, maritalstat, occupation, relationship, race, sex, cap_gain, cap_loss, hrs_per_wk, native_country, morethan50k]
Index: []

In [22]:
newdf = small.query('sex == "Female" and morethan50k == ">50K"')

In [23]:
newdf

        education     sex morethan50k
46      Assoc-voc  Female        >50K
90        Masters  Female        >50K
93        Masters  Female        >50K
120     Bachelors  Female        >50K
127     Doctorate  Female        >50K
...           ...     ...         ...
48812   Bachelors  Female        >50K
48818   Bachelors  Female        >50K
48820   Bachelors  Female        >50K
48827  Assoc-acdm  Female        >50K
48842     HS-grad  Female        >50K

[1769 rows x 3 columns]

In [24]:
fem_50k = (small['morethan50k'] == ">50K") 
fem = (small['sex'] == "Female")
data[fem_50k & fem].value_counts()

age  workclass         fnlwgt  education     edu_num  maritalstat         occupation       relationship    race   sex     cap_gain  cap_loss  hrs_per_wk  native_country      morethan50k
19   ?                 200790  12th          8        Married-civ-spouse  ?                Other-relative  White  Female  15024     0         40          United-States       >50K           1
41   Self-emp-not-inc  169023  Bachelors     13       Married-civ-spouse  Adm-clerical     Wife            White  Female  7688      0         40          United-States       >50K           1
42   Federal-gov       348059  Assoc-acdm    12       Separated           Prof-specialty   Unmarried       White  Female  0         0         40          United-States       >50K           1
                       178074  Masters       14       Married-civ-spouse  Adm-clerical     Wife            White  Female  0         1902      40          United-States       >50K           1
                       170230  Masters       14       Never-married       Exec-managerial  Not-in-family   White  Female  14084     0         60          United-States       >50K           1
                                                                                                                                                                                            ..
22   Self-emp-not-inc  202920  HS-grad       9        Never-married       Prof-specialty   Unmarried       White  Female  99999     0         40          Dominican-Republic  >50K           1
     Private           195532  Bachelors     13       Never-married       Prof-specialty   Not-in-family   White  Female  8614      0         40          United-States       >50K           1
21   Private           334618  Some-college  10       Never-married       Protective-serv  Not-in-family   Black  Female  99999     0         40          United-States       >50K           1
                       227307  HS-grad       9        Married-civ-spouse  Adm-clerical     Wife            White  Female  0         0         43          United-States       >50K           1
90   Private           88991   Bachelors     13       Married-civ-spouse  Exec-managerial  Wife            White  Female  0         0         40          England             >50K           1
Length: 1769, dtype: int64

In [25]:
from sklearn.datasets import fetch_openml

data2 = fetch_openml(data_id=1590, as_frame=True)
X = pd.get_dummies(data2.data)

In [32]:
data2

{'data':         age     workclass    fnlwgt     education  education-num  \
 0      25.0       Private  226802.0          11th            7.0
 1      38.0       Private   89814.0       HS-grad            9.0
 2      28.0     Local-gov  336951.0    Assoc-acdm           12.0
 3      44.0       Private  160323.0  Some-college           10.0
 4      18.0           NaN  103497.0  Some-college           10.0
 ...     ...           ...       ...           ...            ...
 48837  27.0       Private  257302.0    Assoc-acdm           12.0
 48838  40.0       Private  154374.0       HS-grad            9.0
 48839  58.0       Private  151910.0       HS-grad            9.0
 48840  22.0       Private  201490.0       HS-grad            9.0
 48841  52.0  Self-emp-inc  287927.0       HS-grad            9.0

            marital-status         occupation relationship   race     sex  \
 0           Never-married  Machine-op-inspct    Own-child  Black    Male
 1      Married-civ-spouse    Farming-fishing      Husband  White    Male
 2      Married-civ-spouse    Protective-serv      Husband  White    Male
 3      Married-civ-spouse  Machine-op-inspct      Husband  Black    Male
 4           Never-married                NaN    Own-child  White  Female
 ...                   ...                ...          ...    ...     ...
 48837  Married-civ-spouse       Tech-support         Wife  White  Female
 48838  Married-civ-spouse  Machine-op-inspct      Husband  White    Male
 48839             Widowed       Adm-clerical    Unmarried  White  Female
 48840       Never-married       Adm-clerical    Own-child  White    Male
 48841  Married-civ-spouse    Exec-managerial         Wife  White  Female

        capital-gain  capital-loss  hours-per-week native-country
 0               0.0           0.0            40.0  United-States
 1               0.0           0.0            50.0  United-States
 2               0.0           0.0            40.0  United-States
 3            7688.0           0.0            40.0  United-States
 4               0.0           0.0            30.0  United-States
 ...             ...           ...             ...            ...
 48837           0.0           0.0            38.0  United-States
 48838           0.0           0.0            40.0  United-States
 48839           0.0           0.0            40.0  United-States
 48840           0.0           0.0            20.0  United-States
 48841       15024.0           0.0            40.0  United-States

 [48842 rows x 14 columns],
 'target': 0        <=50K
 1        <=50K
 2         >50K
 3         >50K
 4        <=50K
          ...
 48837    <=50K
 48838     >50K
 48839    <=50K
 48840    <=50K
 48841     >50K
 Name: class, Length: 48842, dtype: category
 Categories (2, object): ['>50K', '<=50K'],
 'frame':         age     workclass    fnlwgt     education  education-num  \
 0      25.0       Private  226802.0          11th            7.0
 1      38.0       Private   89814.0       HS-grad            9.0
 2      28.0     Local-gov  336951.0    Assoc-acdm           12.0
 3      44.0       Private  160323.0  Some-college           10.0
 4      18.0           NaN  103497.0  Some-college           10.0
 ...     ...           ...       ...           ...            ...
 48837  27.0       Private  257302.0    Assoc-acdm           12.0
 48838  40.0       Private  154374.0       HS-grad            9.0
 48839  58.0       Private  151910.0       HS-grad            9.0
 48840  22.0       Private  201490.0       HS-grad            9.0
 48841  52.0  Self-emp-inc  287927.0       HS-grad            9.0

            marital-status         occupation relationship   race     sex  \
 0           Never-married  Machine-op-inspct    Own-child  Black    Male
 1      Married-civ-spouse    Farming-fishing      Husband  White    Male
 2      Married-civ-spouse    Protective-serv      Husband  White    Male
 3      Married-civ-spouse  Machine-op-inspct      Husband  Black    Male
 4           Never-married                NaN    Own-child  White  Female
 ...                   ...                ...          ...    ...     ...
 48837  Married-civ-spouse       Tech-support         Wife  White  Female
 48838  Married-civ-spouse  Machine-op-inspct      Husband  White    Male
 48839             Widowed       Adm-clerical    Unmarried  White  Female
 48840       Never-married       Adm-clerical    Own-child  White    Male
 48841  Married-civ-spouse    Exec-managerial         Wife  White  Female

        capital-gain  capital-loss  hours-per-week native-country  class
 0               0.0           0.0            40.0  United-States  <=50K
 1               0.0           0.0            50.0  United-States  <=50K
 2               0.0           0.0            40.0  United-States   >50K
 3            7688.0           0.0            40.0  United-States   >50K
 4               0.0           0.0            30.0  United-States  <=50K
 ...             ...           ...             ...            ...    ...
 48837           0.0           0.0            38.0  United-States  <=50K
 48838           0.0           0.0            40.0  United-States   >50K
 48839           0.0           0.0            40.0  United-States  <=50K
 48840           0.0           0.0            20.0  United-States  <=50K
 48841       15024.0           0.0            40.0  United-States   >50K

 [48842 rows x 15 columns],
 'categories': None,
 'feature_names': ['age',
  'workclass',
  'fnlwgt',
  'education',
  'education-num',
  'marital-status',
  'occupation',
  'relationship',
  'race',
  'sex',
  'capital-gain',
  'capital-loss',
  'hours-per-week',
  'native-country'],
 'target_names': ['class'],
 'DESCR': '**Author**: Ronny Kohavi and Barry Becker  \n**Source**: [UCI](https://archive.ics.uci.edu/ml/datasets/Adult) - 1996  \n**Please cite**: Ron Kohavi, "Scaling Up the Accuracy of Naive-Bayes Classifiers: a Decision-Tree Hybrid", Proceedings of the Second International Conference on Knowledge Discovery and Data Mining, 1996  \n\nPrediction task is to determine whether a person makes over 50K a year. Extraction was done by Barry Becker from the 1994 Census database. A set of reasonably clean records was extracted using the following conditions: ((AAGE>16) && (AGI>100) && (AFNLWGT>1)&& (HRSWK>0))\n\nThis is the original version from the UCI repository, with training and test sets merged.\n\n### Variable description\n\nVariables are all self-explanatory except __fnlwgt__. This is a proxy for the demographic background of the people: "People with similar demographic characteristics should have similar weights". This similarity-statement is not transferable across the 51 different states.\n\nDescription from the donor of the database: \n\nThe weights on the CPS files are controlled to independent estimates of the civilian noninstitutional population of the US.  These are prepared monthly for us by Population Division here at the Census Bureau. We use 3 sets of controls. These are:\n1.  A single cell estimate of the population 16+ for each state.\n2.  Controls for Hispanic Origin by age and sex.\n3.  Controls by Race, age and sex.\n\nWe use all three sets of controls in our weighting program and "rake" through them 6 times so that by the end we come back to all the controls we used. The term estimate refers to population totals derived from CPS by creating "weighted tallies" of any specified socio-economic characteristics of the population. People with similar demographic characteristics should have similar weights. There is one important caveat to remember about this statement. That is that since the CPS sample is actually a collection of 51 state samples, each with its own probability of selection, the statement only applies within state.\n\n\n### Relevant papers  \n\nRonny Kohavi and Barry Becker. Data Mining and Visualization, Silicon Graphics.  \ne-mail: ronnyk \'@\' live.com for questions.\n\nDownloaded from openml.org.',
 'details': {'id': '1590',
  'name': 'adult',
  'version': '2',
  'description_version': '8',
  'format': 'ARFF',
  'upload_date': '2015-06-09T16:39:06',
  'licence': 'Public',
  'url': 'https://api.openml.org/data/v1/download/1595261/adult.arff',
  'parquet_url': 'http://openml1.win.tue.nl/dataset1590/dataset_1590.pq',
  'file_id': '1595261',
  'default_target_attribute': 'class',
  'version_label': '2',
  'tag': ['OpenML-CC18',
   'OpenML100',
   'study_123',
   'study_135',
   'study_14',
   'study_144',
   'study_218',
   'study_241',
   'study_34',
   'study_99'],
  'visibility': 'public',
  'original_data_url': 'https://archive.ics.uci.edu/ml/datasets/adult',
  'minio_url': 'http://openml1.win.tue.nl/dataset1590/dataset_1590.pq',
  'status': 'active',
  'processing_date': '2018-10-03 21:37:04',
  'md5_checksum': 'bb6510925e5d4b23d136715febb2cdf5'},
 'url': 'https://www.openml.org/d/1590'}

In [26]:
y_true = (data2.target == '>50K') * 1
sex = data2.data['sex']
sex.value_counts()

Male      32650
Female    16192
Name: sex, dtype: int64

In [27]:
y_true.value_counts()

0    37155
1    11687
Name: class, dtype: int64